#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.data_products["test.yml"].time_rotating.rotation: Refreshing state... [id=2023-04-19T09:58:39Z][0m
[0m[1mazurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg][0m
[0m[1mazurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_products["test.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg][0m
[0m[1mazurerm_resource_group.management_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-mgmt-rg][0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001][0m
[0m[1mmodule.data_products["test.yml"].azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mazurerm_subnet.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001][0m
[0m[1mazurerm_subnet.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001][0m
[0m[1mazurerm_subnet.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet.devops_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.powerbi_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.powerbi_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/8cd998e9-6266-d2ed-515b-33f10fa9086a][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_aut_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_aut_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_exp_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_exp_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/ca7ccc96-197c-f8d6-fa39-5a7777ee0b7b][0m
[0m[1mazurerm_subnet_route_table_association.devops_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.devops_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-datafactory-pe][0m
[0m[1mazurerm_subnet_route_table_association.runtimes_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-portal-pe][0m
[0m[1mazurerm_subnet_network_security_group_association.runtimes_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.storage_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_route_table_association.storage_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-kv001-pe][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-kv001-pe][0m
[0m[1mmodule.data_products["test.yml"].data.azuread_group.security_group[0]: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_client_config.current: Read complete after 0s [id=3556be79-2979-4b19-a1af-4dd4e6d9ed7e-04b07795-8ddb-461a-bbee-02f9e1bf7b46-ab5172e1-da66-42da-b711-ff01dd130576][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_group.security_group[0]: Read complete after 1s [id=238f1be3-8722-41ab-ac00-0ac9b8703915][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb][0m
[0m[1mmodule.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].azuread_application.application[0]: Refreshing state... [id=f40534d3-c31f-4df8-ab9d-c4c45cbf7cda][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupObjectId][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_display_name[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupDisplayName][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1ed03e24-4a7f-e600-c1b7-2bd3cec0e000][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/7676dddf-ebc9-97f9-5d42-b1bb838c0b00][0m
[0m[1mmodule.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-queue-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-blob-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/managementPolicies/default][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-table-pe][0m
[0m[1mmodule.datalake_enriched.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-dfs-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-blob-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-dfs-pe][0m
[0m[1mmodule.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-blob-pe][0m
[0m[1mmodule.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/inboundNatPools/mydlz01-dev-shir001-natpool][0m
[0m[1mmodule.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/probes/mydlz01-dev-shir001-probe][0m
[0m[1mmodule.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/backendAddressPools/mydlz01-dev-shir001-backendaddresspool][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalObjectId][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83][0m
[0m[1mmodule.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001/integrationruntimes/mydlz01-dev-shir001][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-blob-pe][0m
[0m[1mmodule.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/managementPolicies/default][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-dfs-pe][0m
[0m[1mmodule.datalake_curated.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default/containers/data][0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_current_user.current_user: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E963F6819300179D][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E963F6819300179E][0m
[0m[1mmodule.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=4175911308037159|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/loadBalancingRules/mydlz01-dev-shir001-rule][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_tenant_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalTenantId][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83/password/9826a6da-9e12-4919-a0ec-6c5e1cc1f676][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientId][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E964305C0B000000][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=2769391400051353|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E964305C0B000001][0m
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_current_user.current_user: Reading...[0m[0m
[0m[1mmodule.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz01-dev-shir001][0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_current_user.current_user: Read complete after 4s [id=3268084265185994][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_workspace: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_enriched: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_raw: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_secret[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientSecret][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_curated: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_workspace: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_enriched: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_raw: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_curated: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_current_user.current_user: Read complete after 3s [id=3268084265185994][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # module.data_products["test.yml"].azapi_resource.container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "container_workspace" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m metadata     = {}
                  [32m+[0m[0m publicAccess = "None"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "test-prd"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2022-09-01"
    }

[1m  # module.data_products["test.yml"].azapi_resource.subnet[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.32.96/28"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DataProductSubnet-test-prd"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_dbac_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_dbac_member" {
      [32m+[0m[0m group_object_id  = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = (known after apply)
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_sp_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_sp_member" {
      [32m+[0m[0m group_object_id  = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = "56c1256c-3efb-4f70-8414-4d139b681e83"
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_uai_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_uai_member" {
      [32m+[0m[0m group_object_id  = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_databricks_access_connector.databricks_access_connector[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "test-prd-dbac001"
      [32m+[0m[0m resource_group_name = "test-prd-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_products["test.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "test-prd-vault001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "test-prd-vault001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "test-prd-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "test-prd-vault001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "test-prd-vault001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_resource_group" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnet[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_subnet" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "238f1be3-8722-41ab-ac00-0ac9b8703915"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_user_assigned_identity.user_assigned_identity[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "test-prd-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "test-prd-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1m  # module.data_products["test.yml"].databricks_catalog.automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "automation_catalog" {
      [32m+[0m[0m comment       = "Data Product Catalog - test-prd"
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m metastore_id  = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"
      [32m+[0m[0m name          = "test-prd"
      [32m+[0m[0m owner         = (known after apply)
      [32m+[0m[0m properties    = {
          [32m+[0m[0m "purpose" = "Data Product Catalog - test-prd"
        }
      [32m+[0m[0m storage_root  = "abfss://mydlz01devstwsp@test-prd.dfs.core.windows.net/"
    }

[1m  # module.data_products["test.yml"].databricks_external_location.automation_external_location[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "automation_external_location" {
      [32m+[0m[0m comment         = "Default Storage for test-prd Data Product"
      [32m+[0m[0m credential_name = "test-prd"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "test-prd"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m skip_validation = true
      [32m+[0m[0m url             = "abfss://mydlz01devstwsp@test-prd.dfs.core.windows.net/"
    }

[1m  # module.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "automation_storage_credential" {
      [32m+[0m[0m comment      = "Managed identity credential for test-prd Data Product"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m name         = "test-prd"
      [32m+[0m[0m owner        = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = (known after apply)
        }
    }

[1m  # module.databricks_automation.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001"
        name                            = "mydlz01-dev-aut-kv001"
      [33m~[0m[0m public_network_access_enabled   = true [33m->[0m[0m false
        tags                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.databricks_automation_configuration.databricks_grants.grants_current_user[0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_current_user" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m metastore = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "admin@mngenv496918.onmicrosoft.com"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "CREATE_CATALOG",
              [32m+[0m[0m "CREATE_EXTERNAL_LOCATION",
            ]
        }
    }

[1m  # module.databricks_experimentation.azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001"
        name                            = "mydlz01-dev-exp-kv001"
      [33m~[0m[0m public_network_access_enabled   = true [33m->[0m[0m false
        tags                            = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.databricks_experimentation_configuration.databricks_grants.grants_current_user[0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_current_user" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m metastore = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "admin@mngenv496918.onmicrosoft.com"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "CREATE_CATALOG",
              [32m+[0m[0m "CREATE_EXTERNAL_LOCATION",
            ]
        }
    }

[1mPlan:[0m 16 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>